{
  "Home": "家",
  "About": "について",
  "Skills": "スキル",
  "Resume": "再開する",
  "Education": "教育",
  "Projects": "プロジェクト",
  "Contact": "接触",
  "Frontend": "フロントエンド",
  "Developer": "開発者",
  "Hi! I'm": "こんにちは！私は",
  "A creative Frontend Developer with 3+ years of experience in building high-performance, scalable, and responsive web solutions": "高性能、スケーラブル、レスポンシブなウェブソリューションの構築に3年以上の経験を持つクリエイティブなフロントエンド開発者",

  "Hello. my name is vijay athiraj. nice to meet you I would like to welcome you with my personal portfolio": "こんにちは。私の名前はVijay Athirajです。初めまして。私の個人的なポートフォリオであなたを歓迎したいと思います。",
  "About Me": "私について",
  "Passionate web developer skilled in HTML, CSS, JavaScript, Node.js, React.js, and Next.js. Dedicated to creating seamless and engaging user experiences through high-quality web solutions.": "HTML、CSS、JavaScript、node.js、React.js、およびnext.jsに熟練した情熱的なWeb開発者",
  "Explore my portfolio to see samples of my work that highlight my UI design standards and attention to detail.": "私のポートフォリオを探索して、UIのデザイン標準と細部への注意を強調する私の作品のサンプルをご覧ください。",
  "Name": "名前",
  "Date of birth": "生年月日",
  "Address": "住所",
  "City": "市",
  "Pin code": "ピンコード",
  "Current Location": "現在地",
  "Phone": "電話",
  "Projects Completed": "プロジェクトが完了しました",
  "Download CV": "履歴書をダウンロードします",
  "For HRs": "人事担当者向け",
  "HUMAN BEING": "人間",
  "UI UX DESIGN": "UI UXデザイン",
  "PHOTOSHOP BEGINNER": "Photoshopの初心者",
  "UI UX DEVELOPMENT": "UI UX開発",
  "ICON DESIGN": "アイコンデザイン",
  "My journey of learning has been a continuous adventure, shaping me into the professional I am today. Here's a look at my academic background and key milestones that have equipped me with the knowledge and skills to excel.": "私の学びの旅は、まさに絶え間ない冒険であり、今日のプロフェッショナルとしての私を形作ってきました。ここでは、私の学歴と、卓越した知識とスキルを身につけさせてくれた重要な節目についてご紹介します。",
  "MSC (MATHEMATICS)": "MSC（数学）",
  "BSC (MATHEMATICS)": "BSC（数学）",
  "Class XII": "クラスXII",
  "BSC (MATHS)": "BSC (MATHS)",
  "MSC (MATHS)": "MSC (MATHS)",
  "2020-2022": "2020-2022",
  "Arulmigu Kalasalingam College of Arts and Science Arulmigu Kalasalingam College of Arts and Science": "Arulmigu Kalasalingam College of Arts and Science Arulmigu Kalasalingam College of Arts and Science",
  "Ayya Nadar Janaki Ammal College Ayya Nadar Janaki Ammal College": "Ayya Nadar Janaki Ammal College Ayya Nadar Janaki Ammal College",
  "G S Hindu Higher Secondary School G S Hindu Higher Secondary School": "G S Hindu Higher Secondary School G S Hindu Higher Secondary School",

  "Master Degree in Mathematics": "数学の修士号",
  "My M.Sc. journey at Ayya Nadar Janaki Ammal College in Sivakasi was an enriching chapter of my life. The institution not only honed my mathematical skills but also became the canvas for countless memories. From late-night study sessions to joyous celebrations, I experienced a spectrum of emotions. The college, with its dedicated faculty and supportive peers, fostered an environment for both academic growth and personal development. It's where I cultivated lasting friendships, faced challenges, and celebrated triumphs, creating a tapestry of happy and sometimes bittersweet moments that I'll cherish forever. and Still i have four Arrears..": "私の修士号",
  "Bachelor's Degree in Mathematics": "数学の学士号",
  "My B.Sc. journey at Arulmigu Kalasalingam College of Arts & Science, Krishnankoil, began with uncertainty about my course choice. However, as time went on, I found clarity and realized my passion for mathematics. The college provided a nurturing environment that allowed me to discover and develop my skills. It was a transformative period, where I not only gained knowledge but also honed my abilities, setting the foundation for my academic and personal growth.": "私のb.sc. ",
  "High school education (TN)": "高校教育（テネシー州）",
  "My school days were truly special, filled with cherished memories and valuable experiences. I had a wonderful group of friends, and we shared countless fun and mischievous moments together. I was dedicated to my studies, always respectful towards my teachers, and valued good behavior. Though I received a few silly punishments from my teachers, they only added to the charm and humor of my school life. The school provided a nurturing environment that encouraged us to excel academically and socially. Those years were a time of laughter, learning, and personal development, laying a strong foundation for my future endeavors.": "私の学生時代は本当に特別で、大切な思い出と貴重な経験に満ちていました。",
  "Talents": "才能",
  "Technical": "テクニカル",
  "In my journey toward independence and self-reliance, I'm continuously developing a range of practical skills. The rating stars below represent my current self-assessment, which is subjective and subject to change as I learn and grow. Remember, skill development is a lifelong process, and I'm committed to deepening my understanding through ongoing learning and real-world experience.": "自立と自立への道のりにおいて、私は様々な実践的なスキルを継続的に磨いています。以下の評価星は、私の現在の自己評価を表しています。これは主観的なものであり、学習と成長に伴って変化する可能性があります。スキル開発は生涯にわたるプロセスであり、継続的な学習と実社会での経験を通して理解を深めていくことに尽力しています。",
  "One of My Fav Quote": "私のお気に入りの引用の1つ",
  "Tamil Quote": "タミルの引用",
  "Translation": "翻訳",
  "What you have learned is but a handful of sand; what you have not learned is the size of the world": "あなたが学んだことは、ほんの一握りの砂です。",
  "Rating": "評価",
  "Backend": "バックエンド",
  "Database": "データベース",
  "Fundamentals": "基礎",
  "DevOps": "DevOps",

  "Building responsive and dynamic user interfaces": "応答性と動的なユーザーインターフェースの構築",
  "Creating robust APIs and server-side applications": "堅牢なAPIとサーバーサイドアプリケーションの作成",
  "Managing and designing efficient data storage solutions": "効率的なデータストレージソリューションの管理と設計",
  "Deployment, CI/CD, and server management": "デプロイメント、CI/CD、サーバー管理",
  "Core web development concepts and best practices": "ウェブ開発のコアコンセプトとベストプラクティス",

  "Experience": "経験",
  "Work": "仕事",
  "Throughout my career, I've had the privilege of working with two outstanding companies, each contributing to my growth and expertise in different ways. Here's a glimpse into my journey with these organizations:": "私のキャリアを通じて、私は2つの優れた企業と協力する特権を持っていました。それぞれが私の成長と専門知識にさまざまな方法で貢献しています。",
  "Azure Soft Tech Solutions": "Azure Soft Tech Solutions",
  "Software Associate": "ソフトウェアアソシエイト",
  "During my tenure at Azure Soft Tech Solutions, I served as a Software Associate, contributing to the development of various software solutions. This experience allowed me to apply my skills and knowledge in practical settings, working on diverse projects that enriched my understanding of software development processes and technologies. I collaborated closely with a talented team, gaining valuable insights into problem-solving, coding best practices, and project management. My time at Azure Softtech Solutions was instrumental in shaping my career and providing a strong foundation for my future endeavors.": "Azure Soft Tech Solutions在職中、ソフトウェアアソシエイトとして様々なソフトウェアソリューションの開発に貢献しました。この経験を通して、私は自分のスキルと知識を実践的な現場で活かすことができ、多様なプロジェクトに携わることで、ソフトウェア開発のプロセスとテクノロジーへの理解を深めることができました。優秀なチームと緊密に連携し、問題解決、コーディングのベストプラクティス、プロジェクト管理に関する貴重な洞察を得ることができました。Azure Softtech Solutionsでの経験は、私のキャリア形成に大きく貢献し、将来の挑戦に向けた強固な基盤を築くことができました。",
  "RAMSOL PVT LTD": "Ramsol Pvt Ltd",
  "Consultant Front-end Dev": "コンサルタントフロントエンド開発",
  "Joining Ramsol Private Ltd as a Frontend Developer marked the next exciting chapter in my career. In this role, I took on the responsibility of crafting engaging and user-friendly interfaces for web applications. Working with cutting-edge frontend technologies, I had the privilege of contributing to projects that aimed to deliver exceptional user experiences. My time at Ramsol Private Ltd further deepened my frontend development skills and allowed me to collaborate with a dynamic team dedicated to innovation. It has been a valuable experience that has expanded my horizons and propelled my career in web development to new heights.": "Ramsol Private LtdにFrontend開発者として参加することは、私のキャリアの次のエキサイティングな章をマークしました。",
  "Infoapto Technologies": "Infoaptoテクノロジー",
  "Joining InfoApto Technologies as a Frontend Developer was an exhilarating step forward in my professional journey. Here, I embraced the opportunity to work with an array of cutting-edge technologies, including Electron, React Native for mobile applications, Next.js, and React with TypeScript. This diverse tech stack allowed me to not only craft sophisticated and user-friendly interfaces but also develop cross-platform applications that deliver exceptional user experiences. My role at InfoApto Technologies extended beyond development. I gained invaluable knowledge about deploying applications on AWS, managing SSL configurations, and ensuring the highest standards of security and performance. This holistic experience not only enhanced my technical skills but also broadened my understanding of the end-to-end development lifecycle. Working with a dynamic and innovative team at InfoApto Technologies has been a remarkable journey. It has enriched my expertise, fueled my passion for frontend development, and set me on a path of continuous learning and growth. This experience has been instrumental in propelling my career to new heights and expanding my horizons in the world of web and mobile application development.": "Frontend開発者としてInfoaptoテクノロジーに参加することは、私の専門的な旅で爽快な一歩でした。",
  "Wherever the wind takes me...": "風が私を連れて行くところはどこでも...",
  "The future is fluid. Each act, each decision, and each development creates new possibilities and eliminates others. Be not afraid of discomfort. If you can't put yourself in a situation where you are uncomfortable, then you will never grow. You will never change. You'll never learn. so We only have control over the choice; we have no control over what is happening.": "未来は流動的です。",
  "Repos": "レポス",
  "Dev": "開発",
  "Repositories": "リポジトリ",
  "Hoarding happiness in my free time, I love diving into the world of cartoons and anime. You can often find me laughing along with the antics of Naruto, Shinchan, and Tom and Jerry. I also enjoy revisiting classics like Ben 10, Courage the Cowardly Dog, Ninja Hattori, Doraemon, and Oggy. These shows are my go-to for a dose of fun and nostalgia.": "暇な時間には幸せを溜め込み、漫画やアニメの世界に浸るのが大好きです。ナルト、しんちゃん、トムとジェリーのいたずらっ子ぶりに大笑いしている姿をよく見かけます。また、「ベン10」「勇気の勇者」「忍者ハットリくん」「ドラえもん」「オギー」といった懐かしい作品も繰り返し見ています。これらの作品は、楽しさと懐かしさを味わうための頼みの綱です。",
  "Projet VIJAY-MERN": "Projet Vijay-Mern",
  "I'm excited to introduce my MERN project, a web application that combines the power of MongoDB, Express.js, React, and Node.js to create a seamless user experience. This project focuses on two essential aspects: User Authentication, Profile Page Management with File System": "Mongodb、Express.js、React、およびnode.jsの力を組み合わせて、シームレスなユーザーエクスペリエンスを作成するWebアプリケーションであるMyRN Projectを紹介することに興奮しています。",
  "React JS Food Order UI": "JSフードオーダーUIを反応します",
  "Introducing my Food Order UI Page React repository - a sleek and interactive user interface for ordering delicious meals. Explore a responsive design, seamless navigation, and a delightful ordering experience.": "私のフードオーダーの紹介UIページReactリポジトリ - おいしい食事を注文するための洗練されたインタラクティブなユーザーインターフェイス。",
  "Shri-chat": "シュリチャット",
  "Discover my Chatting Application built with React.js and Firebase integration, featuring Google login for quick access. Connect with others effortlessly through five default chat groups, fostering real-time conversations and connections. Join the conversation now!": "React.jsとFirebaseの統合で構築されたチャットアプリケーションを発見してください。",
  "VJ-Shri-mens-Wear-cart": "vj-shri-mens-wear-cart",
  "Discover my Men's Cart Purchase Web Application, crafted with HTML, CSS, and JavaScript. It's a valuable resource for learning and practicing essential JavaScript functions while simulating a seamless shopping experience. Dive into coding and shopping simultaneously!": "HTML、CSS、およびJavaScriptで作成された私の男性のカート購入Webアプリケーションを発見してください。",
  "Responsive Design": "レスポンシブデザイン",
  "An emphasis on cutting-edge design and modern usability standards": "最先端のデザインと最新のユーザビリティ基準に重点を置いています",
  "Personal": "個人的",
  "Happiness": "幸せ",
  "Hoppies": "ホッピー",
  "Awards": "賞",
  "Complete Projects": "完全なプロジェクト",
  "Happy Customers": "幸せな顧客",
  "Cups of Coffee": "コーヒーのカップ",
  "I'm": "私は",
  "Available": "利用可能",
  "for freelancing": "フリーランスのため",
  "Let's collaborate! I'm available for freelance projects and excited to contribute.": "コラボレーションしましょう！",
  "Location": "位置",
  "Current": "現在",
  "Native": "ネイティブ",
  "Email": "メール",
  "Call": "電話",
  "Subject": "主題",
  "Message": "メッセージ",
  "Send Message": "メッセージを送信します",
  "Contact Me": "私に連絡してください",
  "Reach Me": "リーチ・ミー",
  "Your scroll, your jutsu, my inbox. Let's form an alliance and conquer the unknown, together!": "あなたの巻物、あなたの術、私の受信箱。共に同盟を組み、未知の世界を征服しよう！",
  "Just a simple work of imagination.": "想像力の単純な作品。",
  "Chatbot": "チャットボット",
  "Assist My Personal Details": "私の個人的な詳細を支援してください",
  "Visitor": "ビジター",
  "hello": "こんにちは",
  "delivered": "配達",
  "Say Hi": "こんにちはと言ってください",
  "He Visitor, Sorry for the inconvenience. I've developed a chatbot using a custom-trained TensorFlow model and NLP methods, which performs well in my local environment. However, I've faced difficulties deploying it on free cloud services. I intend to deploy it on a dedicated cloud server (AWS, Google Cloud) or a local 24/7 server once I have the resources. I apologize for any inconvenience this may cause and appreciate your understanding.": "彼の訪問者、ご不便をおかけして申し訳ありません。",
  "Ask Freely to": "自由に尋ねてください",

  "A curated selection of my recent professional and personal projects. Each artifact demonstrates my capabilities in full-stack development, robust code architecture using TypeScript, and effective user interface creation with modern frameworks like React and Node.js. Explore the repository links below to see how I translate complex ideas into functional, real-world applications": "A最近の私の仕事と個人的なプロジェクトを厳選してご紹介します。それぞれの成果物は、フルスタック開発、TypeScriptを使用した堅牢なコードアーキテクチャ、ReactやNode.jsなどの最新フレームワークを使用した効果的なユーザーインターフェース作成における私の能力を示しています。以下のリポジトリリンクをご覧になり、複雑なアイデアを機能的で実用的なアプリケーションにどのように変換しているかをご覧ください。",
  "My Academic Score": "学業成績",
  "My official, quantified result based on the established scoring criteria for this academic submission.": "この学術的な提出物に対する、確立された採点基準に基づいた私の正式かつ定量化された結果。",
  "Percentage": "パーセンテージ",
  "Gallery": "ギャラリー",
  "Memories": "思い出",
  "Return to Home": "ホームに戻る",
  "I am currently": "私は現在",
  "Years Experience": "経験年数",
  "All": "全て"
}
